// 各天参会人数
export const numPeopleTotal: number = 5256;
export const maxNumPeopleTotal: [number, number, number] = [3564, 4434, 2930]

export const maxNumVenueTimePopDynamic: { [key: string]: any } = {
    'ratio': { '10001': [206, 390, 433], '10002': [170, 432, 334], '10003': [282, 347, 145], '10004': [260, 194, 0], '10005': [355, 486, 396], '10006': [837, 1308, 716], '10007': [152, 187, 30], '10008': [303, 486, 244], '10009': [1167, 649, 102], '10010': [117, 208, 83], '10011': [684, 681, 258], '10012': [844, 843, 475], '10013': [1895, 2373, 1168], '10014': [187, 194, 119], '10015': [515, 466, 150], '10016': [9, 21, 7], '10017': [563, 622, 312], '20001': [619, 885, 0], '20002': [134, 139, 111], '20003': [633, 1204, 134], '20004': [154, 165, 13], '20005': [190, 303, 74], '20006': [61, 58, 55], '20007': [616, 647, 233] },
    'venues': [1895, 2373, 1168],
    'total': maxNumPeopleTotal
}
export const maxNumVenueTimePopStatic: { [key: string]: any } = {
    'ratio': { '10001': [302, 586, 855], '10002': [549, 1213, 915], '10003': [603, 536, 184], '10004': [488, 405, 0], '10005': [329, 414, 359], '10006': [195, 247, 249], '10007': [7, 31, 3], '10008': [155, 285, 115], '10009': [1221, 1136, 128], '10010': [143, 258, 130], '10011': [144, 137, 21], '10012': [719, 1080, 485], '10013': [2254, 2546, 1564], '10014': [20, 20, 11], '10015': [727, 588, 148], '10016': [14, 25, 10], '10017': [383, 374, 190], '20001': [877, 1525, 0], '20002': [172, 183, 179], '20003': [762, 1381, 162], '20004': [8, 33, 1], '20005': [88, 119, 19], '20006': [50, 79, 36], '20007': [115, 119, 17], 'hallway1': [3564, 4434, 2930], 'hallway2': [0, 1, 1] },
    'venues': [2254, 2546, 1564],
    'total': maxNumPeopleTotal
}
export const maxNumVenueTimePop = {
    'dynamic': maxNumVenueTimePopDynamic,
    'static': maxNumVenueTimePopStatic,
}


// 柯林聚类的变化率情况
// // 各天参会人数
// export const maxNumPeopleTotal: [number, number, number] = [3564, 4434, 2930]

// // 各天所有场馆最多人数, 以5分钟聚类的话
// export const maxNumPeopleVenues: [number, number, number] = [1895, 2373, 1168]

// // 各天,各场馆各自的最多人数, 以5分钟聚类的话
// export const maxNumPeopleSingleVenue: { [key: string]: [number, number, number] } =
//     { '10001': [206, 390, 433], '10002': [170, 432, 334], '10003': [282, 347, 145], '10004': [260, 194, 0], '10005': [355, 486, 396], '10006': [837, 1308, 716], '10007': [152, 187, 30], '10008': [303, 486, 244], '10009': [1167, 649, 102], '10010': [117, 208, 83], '10011': [684, 681, 258], '10012': [844, 843, 475], '10013': [1895, 2373, 1168], '10014': [187, 194, 119], '10015': [515, 466, 150], '10016': [9, 21, 7], '10017': [563, 622, 312], '20001': [619, 885, 0], '20002': [134, 139, 111], '20003': [633, 1204, 134], '20004': [154, 165, 13], '20005': [190, 303, 74], '20006': [61, 58, 55], '20007': [616, 647, 233] }


export const styleMap = {
    venueStroke: 'black',
    venueStrokeWidth: '2px',
    venueFill: 'none',
    gridStroke: 'rgb(240,240,240)',
    wallFill: 'rgb(210,210,210)',
    wallStroke: 'none',
    individRad: 3,
    individFill: 'red',
    venueLineFill: 'rgba(99,172,229,0.3)',
    venueRectFill: 'rgba(173,203,227,0.3)',
    selectRectFill: 'cyan',
    selectRectStroke: 'none',
    selectHandlerStroke: 'black',
    selectHandlerFill: 'none',
    blockSelectedStroke: 'black',
    blockSelectedStrokeWidth: '2px',
}
export const maxNumBlockTimePopDays = {
    'static': [327, 600, 141],
    'dynamic': [810, 1099, 630],
}

export const chNum = ['一', '二', '三', '四']